### Importing libraries

In [16]:
import pandas as pd
import seaborn as sn

### Importing data

In [17]:
df_home = pd.read_csv('./data/home_page_table.csv')

In [22]:
df_payment_page = pd.read_csv('./data/payment_page_table.csv')

In [25]:
df_conformation = pd.read_csv('./data/payment_confirmation_table.csv')

In [28]:
df_search = pd.read_csv('./data/search_page_table.csv')

#### Quick inspection

In [18]:
df_home.head(3)

   user_id       page
0   313593  home_page
1   468315  home_page
2   264005  home_page

In [19]:
df_home.count()

user_id    90400
page       90400
dtype: int64

In [20]:
df_search.head(3)

   user_id         page
0    15866  search_page
1   347058  search_page
2   577020  search_page

In [21]:
df_search.count()

user_id    45200
page       45200
dtype: int64

In [23]:
df_payment_page.head(3)

   user_id          page
0   253019  payment_page
1   310478  payment_page
2   304081  payment_page

In [24]:
df_payment_page.count()

user_id    6030
page       6030
dtype: int64

In [26]:
df_conformation.head(3)

   user_id                       page
0   123100  payment_confirmation_page
1   704999  payment_confirmation_page
2   407188  payment_confirmation_page

In [27]:
df_conformation.count()

user_id    452
page       452
dtype: int64

#### Joining dataframes and renaming columns

In [34]:
df_home.set_index('user_id', inplace = True);

In [35]:
df_search.set_index('user_id', inplace = True);

In [36]:
df_total = df_home.join(df_search, on = 'user_id', how='left', lsuffix='_left', rsuffix='_right')

In [37]:
df_total.tail(3)

         page_left page_right
user_id
167290   home_page        NaN
437765   home_page        NaN
337840   home_page        NaN

In [39]:
df_total.rename({'page_left':'home_page', 'page_right': 'search_page'}, axis=1, inplace = True)

In [41]:
df_total.tail(5)

         home_page  search_page
user_id
456851   home_page          NaN
128619   home_page  search_page
167290   home_page          NaN
437765   home_page          NaN
337840   home_page          NaN